1.
# მომხმარებლის სახელი snake_case ცვლადში
user_name = "ნიკოლოზი"

# მომხმარებლის საყვარელი ჰობი snake_case ცვლადში
user_hobby = "მოგზაურობა"

# შემოტანილი ინფორმაციის დაბეჭდვა f-string-ის გამოყენებით
print(f"გამარჯობა, {user_name}! შენი საყვარელი ჰობია {user_hobby}.")


 #2. რა არის კომენტარები?
# კომენტარი არის კოდის ნაწილი, რომელსაც პროგრამირების ენა (ინტერპრეტატორი) იგნორირებას უკეთებს და არ ასრულებს. პითონში ერთხაზიანი კომენტარი იწყება # სიმბოლოთი.

# რისთვის გამოიყენება კომენტარები?

# კოდის განმარტებისთვის: ეხმარება დეველოპერს ან კოდის მკითხველს მარტივად გაიგოს, თუ რას აკეთებს კოდის კონკრეტული ნაწილი.

# შენიშვნებისთვის: შეგიძლიათ დაიტოვოთ ჩანაწერები მომავალში გასაკეთებელი საქმეების შესახებ.

# კოდის დროებით გათიშვისთვის: ტესტირებისას შეგიძლიათ კოდის ხაზები "დააკომენტაროთ", რათა პროგრამამ ის დროებით გამოტოვოს.

age= 10
print(type(age))