# 1 დავალება:
# შეცდომა იყო, რომ ტექსტური მნიშვნელობა ბრჭყალებში არ ეწერა.
name = "Berdia"

print(name)

# 2. დავალება
# Snake case არის ცვლადების დასახელების სტილი,
# სადაც რამდენიმე სიტყვა ერთმანეთისგან ქვედა ტირეთი (_) გამოიყოფა.
# მაგალითი:

my_name = "Sandro"
print(my_name)

# 3 დავალება
# შეცდომა იყო, რომ ცვლადის სახელში გამოყენებული იყო გამოტოვება (space).
# Python-ში ამის ნაცვლად ვიყენებთ ქვედა ტირეს (_).

my_name = "sandro"

print(my_name) 



# 4 დავალება: 

# 

# შეცდომები:
# 1. ცვლადების სახელებში იყო გამოტოვებები.
# 2. ბრჭყალები არასწორად იყო გამოყენებული.
# 3. რიცხვები ტექსტად იყო ჩაწერილი.
# 4. ცვლადის სახელი ბრჭყალებში ეწერა, ამიტომ
# არ მუშაობდა გამრავლება

first_number = 2
second_number = 10

print(first_number * second_number)
