book = "To Kill a Mockingbird"
page = 315
print(book)
print(page)

print(10 + 5)   # მიმატება
print(20 - 8)   # გამოკლება
print(4 * 5)    # გამრავლება
print(16 / 4)   # გაყოფა



# ტექსტური "5" არის სიმბოლო (სტრიქონი), ხოლო რიცხვითი 5 არის ნამდვილი რიცხვი; მათი მიმატებისას პროგრამების უმეტესობა
# აბრუნებს შეცდომას ან აერთიანებს მათ ("55").



a = 5
b = 10
result = a * b
print(result)

# პირველად ვქმნით ცვლადს და ვანიჭებთ ქალაქის სახელს
city = "თბილისი"

# მეორედ ვიყენებთ იგივე სახელს, ძველი მნიშვნელობა იკარგება
city = "ქუთაისი"

# მესამედ ვიყენებთ იგივე სახელს, ბოლო მნიშვნელობა ანაცვლებს წინა ორს
city = "ბათუმი"

# გამოგვაქვს ბოლო მნიშვნელობა ტერმინალში
print(city)  # შედეგი: ბათუმი
# მოცემულია პითონის კოდი, სადაც შექმნილია ცვლადი full_name, მიენიჭა სახელი და გვარი
# შუა ცარიელი ადგილის (" ") გამოყენებით და დაბეჭდილია ეკრანზე

name= "Berdia"
print(name)

# ამ დავალებაში შეცდომა იყო რომ სახელ ბერდიას ბრჭყალები არ ეწერა თუ არ ეწერებოდა ამ შემთხვევაში SyntaxError - ი იქნებოდა.

# Snake Case არის სიტყვებს შორის დაწერილი ქვედატირე კოდის მწერლის მიერ. მაგ:
my_name= ("ნიკოლოზი")
print(my_name)



first_number = 2
second_number = 10
print(first_number * second_number)
#კოდი სწორია snake_case სტილში და შედეგად აჩვენებს 20-ს: first_number = 2, second_number = 10, print(first_number * second_number).
# განახლებული კოდი: ცვლადებს შორის გამოიყენება ქვედა ტირე (_) სფეისების ნაცვლად.გამრავლების ნიშანი უცვლელია



