# Boolean არის ის ოპერაცია რაც იყენებს მნიშვნელობებს სწორს და არასწორს ანუ True Or False 
people = 20
number = 50
print(people < number) # ამ შემთხვევაში ეს იქნება სწორე ანუ True
print(people > number) # ამ შემთხვევაში ეს იქნება არასწორე ანუ False




# Classwork 2
# ლოგიკური ოპერატორები გვეხმარება რამდენიმე პირობის ერთად შეერთებაში ან შემოწმებაში.
# მათი მეშვეობით პროგრამა იღებს გადაწყვეტილებას, შესრულდეს თუ არა გარკვეული მოქმედება


x = 5
print(x > 3 and x < 10)

# პირობების შეერთება: ამოწმებთ ორივე პირობას ერთდროულად (and).

# არჩევანის მიცემა: საკმარისია ერთი პირობა იყოს სწორი (or).

# მნიშვნელობის შებრუნება: ჭეშმარიტს ხდის მცდარად და პირიქით (not).

# მაგალითები Python - ში and ოპერატორი: აბრუნებს True-ს, თუ ორივე პირობა სწორია.



