# 1. input() ფუნქცია გამოიყენება მომხმარებლისგან მონაცემების მისაღებად.
# ამ შემთხვევაში, სახელი პირდაპირ კოდშივე ჩავწერეთ.

# 2. ცვლადს მივანიჭოთ სახელი „ნიკოლოზი“
name = "ნიკოლოზი"

# დაბეჭდოს შემოტანილი სახელი
print("ჩემი სახელია ნიკოლოზი",)


# ცვლადების შექმნა და მნიშვნელობების მინიჭება
name = "ნიკოლოზი"
color = "ლურჯი"

# შედეგის დაბეჭდვა
print("ჩემი სახელია:", name)
print("ჩემი საყვარელი ფერი არის:", color)


# ცვლადის შექმნა და სახელის შენახვა
name = "ნიკოლოზი"

# მნიშვნელობის დაბეჭდვა
print("მნიშვნელობა:", name)

# მონაცემის ტიპის დაბეჭდვა
print("ტიპი:", type(name))


# ცვლადის შექმნა და ასაკის შენახვა
age = 12

# მნიშვნელობის დაბეჭდვა
print("მნიშვნელობა:", age)

# მონაცემის ტიპის დაბეჭდვა
print("ტიპი:", type(age))

